7767517
36 40
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Split                    splitncnn_0              1 2 2 3 4
Pooling                  maxpool2d_19             1 1 4 5 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_2               1 1 5 6 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_3               1 1 6 7 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Split                    splitncnn_1              1 2 7 8 9
Pooling                  maxpool2d_20             1 1 9 10 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_4               1 1 10 11 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_5               1 1 11 12 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_2              1 2 12 13 14
Pooling                  maxpool2d_21             1 1 14 15 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_6               1 1 15 16 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_7               1 1 16 17 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Split                    splitncnn_3              1 2 17 18 19
Pooling                  maxpool2d_22             1 1 19 20 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_8               1 1 20 21 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_9               1 1 21 22 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Interp                   upsample_41              1 1 22 23 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Concat                   cat_0                    2 1 18 23 24 0=0
Convolution              convrelu_10              1 1 24 25 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_11              1 1 25 26 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Interp                   upsample_42              1 1 26 27 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Concat                   cat_1                    2 1 13 27 28 0=0
Convolution              convrelu_12              1 1 28 29 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              convrelu_13              1 1 29 30 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Interp                   upsample_43              1 1 30 31 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Concat                   cat_2                    2 1 8 31 32 0=0
Convolution              convrelu_14              1 1 32 33 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_15              1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Interp                   upsample_44              1 1 34 35 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Concat                   cat_3                    2 1 3 35 36 0=0
Convolution              convrelu_16              1 1 36 37 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_17              1 1 37 38 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_18                  1 1 38 out0 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
